---
kind: other
id: Properties.T:Autodesk.Revit.DB.ComponentRepeaterSlot
source: html/7adc4f35-3547-f0b9-c536-c55181018b97.htm
---
# ComponentRepeaterSlot Properties

The id of the assembly instance to which the element belongs.